---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalLoopType.External
enum: Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType.External

Loops outside all other loops.
 In case of multiple nested loops, this will return the most external loop.